##### Missing Data
##### Duplicates
##### Outliers
##### Sample
##### Dummies

In [1]:
import numpy as np
import pandas as pd

## Handling Missing Data

In [3]:
from numpy import nan as NA

In [3]:
s = pd.Series([3, NA, 8, NA, 5])
s

0    3.0
1    NaN
2    8.0
3    NaN
4    5.0
dtype: float64

In [4]:
s.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [6]:
myser = s[s.notnull()]
myser

0    3.0
2    8.0
4    5.0
dtype: float64

این یک روش حذف داده های گم شده یا نن هست. راه دیگه به صورت زیر میباشد

In [7]:
s.dropna()

0    3.0
2    8.0
4    5.0
dtype: float64

In [8]:
df = pd.DataFrame ([[4, 9, 5], [2, NA, NA], [NA, NA, NA], [NA, 8, 6]])
df

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

In [10]:
cleaned = df.dropna()
cleaned

     0    1    2
0  4.0  9.0  5.0

کار دراپ ان ا اینجوریه که تو دیتافریم نگاه میکنه هر سطری که حتی یه دونه نن داشته باشته رو کل اون سطر رو حذف میکنه

In [11]:
df.dropna(how='all')

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
3  NaN  8.0  6.0

اومده فقط سطری که همش نن بوده رو حذف کرده

In [13]:
df[4] = NA
df

     0    1    2   4
0  4.0  9.0  5.0 NaN
1  2.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  8.0  6.0 NaN

In [14]:
df.dropna(axis=1, how='all')

     0    1    2
0  4.0  9.0  5.0
1  2.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  8.0  6.0

اون تیکه اکسیس مساوی یک یعنی نگاه رو ستونی کرده. و چون هو مساوی آل هست اومدی ستون هایی که همشون نن هست رو حذف کرده

In [17]:
d = [[14, NA, NA], [12, NA, NA], [18, NA, 7], [18, NA, 16], [15, 12, 19], [13, 1, 6]]
df = pd.DataFrame(d)
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [18]:
df.dropna()

    0     1     2
4  15  12.0  19.0
5  13   1.0   6.0

In [20]:
df.dropna(thresh=2)

    0     1     2
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

یک حد گذاشتیم. گفتیم اگر سطری حداقل دو تا نن داشت اون سطر رو حذف کن

## fillna: Filling in Missing Data

In [21]:
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [22]:
df.fillna(0)

    0     1     2
0  14   0.0   0.0
1  12   0.0   0.0
2  18   0.0   7.0
3  18   0.0  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [23]:
df

    0     1     2
0  14   NaN   NaN
1  12   NaN   NaN
2  18   NaN   7.0
3  18   NaN  16.0
4  15  12.0  19.0
5  13   1.0   6.0

In [24]:
df.fillna({1: 0, 2:1})

    0     1     2
0  14   0.0   1.0
1  12   0.0   1.0
2  18   0.0   7.0
3  18   0.0  16.0
4  15  12.0  19.0
5  13   1.0   6.0

ستون یک اگر نن دیدی بذار صفر. ستون دو اگر نن دیدی بذار یک

In [25]:
df.fillna(0, inplace=True)

In [26]:
df

    0     1     2
0  14   0.0   0.0
1  12   0.0   0.0
2  18   0.0   7.0
3  18   0.0  16.0
4  15  12.0  19.0
5  13   1.0   6.0

inplace = True means what happens to df is saved in df. the df is changed

In [27]:
#

In [28]:
d = [[15, 12, 19], [13, 1, 6], [18, NA, 7], [18, NA, 16], [14, NA, NA], [12, NA, NA]]
df = pd.DataFrame(d)
df

    0     1     2
0  15  12.0  19.0
1  13   1.0   6.0
2  18   NaN   7.0
3  18   NaN  16.0
4  14   NaN   NaN
5  12   NaN   NaN

In [29]:
df.fillna(method='ffill')

    0     1     2
0  15  12.0  19.0
1  13   1.0   6.0
2  18   1.0   7.0
3  18   1.0  16.0
4  14   1.0  16.0
5  12   1.0  16.0

این متد اینجوریه که هر داده ای که وجود نداشت مقدار اش رو از ستون بالایی (خانه بالایی) نگاه میکنه و اونو میذاره

In [30]:
df.fillna(method='ffill', limit=3)

    0     1     2
0  15  12.0  19.0
1  13   1.0   6.0
2  18   1.0   7.0
3  18   1.0  16.0
4  14   1.0  16.0
5  12   NaN  16.0

In [31]:
#

In [32]:
s = pd.Series([6, NA, 4, NA, 5])
s

0    6.0
1    NaN
2    4.0
3    NaN
4    5.0
dtype: float64

In [33]:
s.mean()

5.0

برای میانگین گیری نن ها رو حساب نکرد

In [35]:
s.fillna(s.mean())

0    6.0
1    5.0
2    4.0
3    5.0
4    5.0
dtype: float64

اومده عددهایی که نن بودن رو به جاشون میانگین اعداد رو گذاشته

## drop_duplicate: Removing Duplicates

In [37]:
frame = pd.DataFrame({'col1': ['a', 'b', 'a', 'b', 'a', 'b', 'b'],
                      'col2': [1, 1, 2, 3, 3, 4, 4]})
frame

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4
6    b     4

In [38]:
frame.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

سطر تکراری رو داره ترو میده

In [39]:
frame.drop_duplicates()

  col1  col2
0    a     1
1    b     1
2    a     2
3    b     3
4    a     3
5    b     4

In [40]:
frame.drop_duplicates(['col1'])

  col1  col2
0    a     1
1    b     1

In [41]:
frame.drop_duplicates(['col1'], keep='last')

  col1  col2
4    a     3
6    b     4

تکراری ها رو حذف میکنه و آخرین اش رو نگه میداره

In [43]:
frame.drop_duplicates(['col2'])

  col1  col2
0    a     1
2    a     2
3    b     3
5    b     4

## replace: Replacing Values

In [45]:
myser = pd.Series([13, 9, 20, 9, 4, 17])
myser

0    13
1     9
2    20
3     9
4     4
5    17
dtype: int64

In [46]:
myser.replace({9: np.nan, 4: 0})

0    13.0
1     NaN
2    20.0
3     NaN
4     0.0
5    17.0
dtype: float64

In [47]:
myser.replace([9, 18], [np.nan, 0])

0    13.0
1     NaN
2    20.0
3     NaN
4     4.0
5    17.0
dtype: float64

یک لیست رو میتونیم با یک لیست دیگه جایگزین کنیم

## cut

In [48]:
score = [20, 8, 17, 10]
bins = [0, 9, 15, 20]

In [49]:
c = pd.cut(score, bins)
c.categories

IntervalIndex([(0, 9], (9, 15], (15, 20]], dtype='interval[int64, right]')

اون بینز در واقع داره بازه بندی میکنه. الان تو این خط بالایی بازه ها یا کتگوری ها رو دیدیم

In [50]:
c

[(15, 20], (0, 9], (15, 20], (9, 15]]
Categories (3, interval[int64, right]): [(0, 9] < (9, 15] < (15, 20]]

بیست تو بازه پانزده باز تا بیست بسته است و الخ

In [51]:
c.codes

array([2, 0, 2, 1], dtype=int8)

بیست تو بازه شماره دو هست و الخ

In [53]:
pd.value_counts(c)

(15, 20]    2
(0, 9]      1
(9, 15]     1
dtype: int64

پس اگر یکسری داده داشته باشیم اینجوری میتونیم بازه بندی کنیم و با دستور کات ببینیم تو هر بازه چند تا عدد وجود داره

In [55]:
#

In [56]:
score = [20, 8, 17, 10]
bins = [0, 9, 15, 20]
x = pd.cut(score, bins, labels=['bad', 'medium', 'good'])
x

['good', 'bad', 'good', 'medium']
Categories (3, object): ['bad' < 'medium' < 'good']

In [58]:
pd.value_counts(x)

good      2
bad       1
medium    1
dtype: int64

## Detecting Outliers

In [61]:
df = pd.DataFrame(np.random.randn(1000, 3))
df.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean      0.009111     0.011369     0.019215
std       0.975364     1.006959     0.961723
min      -3.359026    -4.305670    -2.870533
25%      -0.635631    -0.655563    -0.655076
50%       0.022553     0.042358     0.039401
75%       0.632181     0.705045     0.691859
max       2.782431     2.827686     2.636888

In [62]:
df.head()

          0         1         2
0 -2.497282  0.693146  1.047926
1 -0.255690  1.708753 -1.689179
2  1.013426 -0.032509  0.416948
3 -2.161139 -0.843464 -0.293810
4  0.333358 -0.904466 -0.132014

In [63]:
s = np.sign(df)
s.head()

     0    1    2
0 -1.0  1.0  1.0
1 -1.0  1.0 -1.0
2  1.0 -1.0  1.0
3 -1.0 -1.0 -1.0
4  1.0 -1.0 -1.0

یک دیتا فریم درست کردیم که علامت اون اعداد داخل دیتافریم رو داره

In [64]:
df[np.abs(df) > 3] = s*3

In [65]:
df.describe()

                 0            1            2
count  1000.000000  1000.000000  1000.000000
mean      0.009470     0.013145     0.019215
std       0.974188     1.000729     0.961723
min      -3.000000    -3.000000    -2.870533
25%      -0.635631    -0.655563    -0.655076
50%       0.022553     0.042358     0.039401
75%       0.632181     0.705045     0.691859
max       2.782431     2.827686     2.636888

داده های کوچکتر از منفی سه رو کردیم سه و اونایی که از سه بزرگتر بودن رو کردیم سه

## take

In [68]:
df = pd.DataFrame(np.arange(12).reshape((4, 3)))
df

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [71]:
p = np.random.permutation(4)
p

array([3, 1, 2, 0])

یک جایگشتی از اعداد صفر و یک و دو و سه میده. هر بار اجرا این عوض میشه

In [72]:
df.take(p) # return the elements in the given positional indices along an axis.

   0   1   2
3  9  10  11
1  3   4   5
2  6   7   8
0  0   1   2

یک جایشگت از اعداد صفر تا سه درست کردیم چون در واقع دیتافریم مون ردیف هاش صفر و یک و دو و سه بودند. حالا ردیف ها رو مطابق همون جایگشت چیدیم. اول ردیف سه بعد یک بعد دو و بعد صفر

## sample: return a random sample of items from an axis of object

In [4]:
df = pd.DataFrame(np.arange(30).reshape(6, 5))
df

    0   1   2   3   4
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
4  20  21  22  23  24
5  25  26  27  28  29

In [5]:
df.sample(n=5)

    0   1   2   3   4
4  20  21  22  23  24
1   5   6   7   8   9
0   0   1   2   3   4
3  15  16  17  18  19
5  25  26  27  28  29

پنج تا سطر از دیتا فریم رو به طور تصادفی میده

In [6]:
s = pd.Series([15, 7, 12, 16])
s.sample(n=2)

1     7
3    16
dtype: int64

یک نمونه گیری تصادفی از داده هامون انجام میدیم

In [7]:
#

In [8]:
a = ['s1', 's2', 's3', 's4']
b = {'F1': [7, 4, 6, 0], 'F2': [2, 1, 3, 0], 'F3': [9, 4, 1, 7]}
df = pd.DataFrame(data=b, index=a)
df

    F1  F2  F3
s1   7   2   9
s2   4   1   4
s3   6   3   1
s4   0   0   7

In [9]:
df.sample(n=2, random_state=1)

    F1  F2  F3
s4   0   0   7
s3   6   3   1

اون رندوم استیت یک باعث میشه هربار اجرا میکنیم همون سطر اس سه و اس چهار رو بده. دیگه رندوم نیست

In [11]:
df.sample(n=2, weights='F3', random_state=1)

    F1  F2  F3
s1   7   2   9
s4   0   0   7

داده هایی رو داد که اف سه بیشترین مقدار رو دارند تو اون سطرها

In [13]:
s

0    15
1     7
2    12
3    16
dtype: int64

In [12]:
s.sample(n=6, replace=True)

3    16
3    16
0    15
0    15
2    12
3    16
dtype: int64

شش تا سمپل داده که چون تعداد سمپل از داده ها بیشتر بوده تکراری هم باید تو داده ها باشه

In [14]:
df

    F1  F2  F3
s1   7   2   9
s2   4   1   4
s3   6   3   1
s4   0   0   7

In [15]:
df.sample(frac=0.5)

    F1  F2  F3
s3   6   3   1
s2   4   1   4

پنجاه درصد داده ها رو به عنوان نمونه تصادفی داد

In [17]:
df['F1'].sample(n=3)

s1    7
s4    0
s3    6
Name: F1, dtype: int64

## get_dummies

In [20]:
s = pd.Series(list('abca'))
s

0    a
1    b
2    c
3    a
dtype: object

In [21]:
pd.get_dummies(s)

   a  b  c
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0

اس چهار تا عضو داره و سه عضو منحصر بفرد. دستوری که اجرا کردیم دیتا فریمی میده که ستون هاش اعضای منحصر بفرد اس و به تعداد اعضای اس هم سطر دارد

حالا تو سری آ عضو صفر بود. تو دیتافریم عضر صفر و آ شده یک و بقیه صفر. همینطور مثلا سطر سوم کجا باید یک باشه؟ قاعدتا روی ستون آ

In [22]:
lst = ['a', 'b', np.nan]
pd.get_dummies(lst)

   a  b
0  1  0
1  0  1
2  0  0

# The End!